### Load dataset

In [30]:
import pandas as pd

In [31]:
df_name = 'Car Ownership.csv'
df = pd.read_csv(df_name)

In [32]:
df.head()

,Occupation,Monthly Income,Credit Score,Years of Employment,Finance Status,Finance History,Car,Number of Children
0,Teacher,40000,750.0,10,Good,No issues,Yes,2
1,Engineer,60000,800.0,8,Good,No issues,Yes,1
2,Nurse,25000,650.0,5,Fair,Late payment 2 months ago,No,0
3,Doctor,80000,900.0,12,Excellent,No issues,Yes,3
4,Businessman,100000,700.0,15,Good,Late payment 6 months ago,Yes,2

### Data normalization

In [33]:
df.columns = df.columns.str.lower().str.replace(' ', '_')

In [34]:
df.columns

Index(['occupation', 'monthly_income', 'credit_score', 'years_of_employment',
       'finance_status', 'finance_history', 'car', 'number_of_children'],
      dtype='object')

In [35]:
df = df[df.occupation.isna()!=True]

In [36]:
df = df[df.car.isna()!=True]

In [40]:
df.number_of_children = df.number_of_children.fillna(0)

occupation              0
monthly_income          2
credit_score           24
years_of_employment    26
finance_status          6
finance_history        11
car                     0
number_of_children      0
dtype: int64

In [53]:
df.monthly_income = df.monthly_income.str.lower().str.replace('$','').str.replace(',','').str.replace('.', '').str.replace(' ', '').str.replace('usd','').str.replace('k', '000')

In [67]:
mean_monthly_income = df.monthly_income[df.monthly_income.isna() != True].astype(int).mean()
df.monthly_income = df.monthly_income.fillna(mean_monthly_income)
df.monthly_income = df.monthly_income.astype(int)

In [69]:
df.dtypes

occupation              object
monthly_income           int64
credit_score           float64
years_of_employment     object
finance_status          object
finance_history         object
car                     object
number_of_children      object
dtype: object